app/views/users/show.html.erb

  <h3>Your order history:</h3>
    <% if @current_user.orders.count > 0 %>
        <% @current_user.orders.each do |order|%>
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 6]]