app/views/orders/show.html.erb


        <% @order.order_items.each do |i| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 5]]